<template>

	<view class="header">
		<!-- 标题 -->
		<view class="title">
			<view class="">
				<text class="text">{{text}}</text>
				<view class="background">
				</view>
			</view>
			<view class="link">
				<el-button class="h-btn" link>
					<el-icon>
						<svg t="1691561700747" class="icon" viewBox="0 0 1024 1024" version="1.1"
							xmlns="http://www.w3.org/2000/svg" p-id="43482" width="32" height="32">
							<path
								d="M497.664 0.512c-150.016 0-271.36 121.344-271.36 271.36s121.344 271.36 271.36 271.36 271.36-121.344 271.36-271.36c0-149.504-121.856-271.36-271.36-271.36z m0 471.04c-110.08 0-199.68-89.6-199.68-199.68s89.6-199.68 199.68-199.68 199.68 89.6 199.68 199.68c0 110.592-89.6 199.68-199.68 199.68zM771.584 630.784H242.176C133.632 630.784 46.08 718.336 46.08 826.88c0 108.032 87.552 196.096 196.096 196.096h529.408c108.032 0 196.096-87.552 196.096-196.096 0-108.544-88.064-196.096-196.096-196.096z m119.296 196.096c0 65.024-57.856 117.76-129.024 117.76H251.904c-71.168 0-129.024-52.736-129.024-117.76s57.856-117.76 129.024-117.76h509.952c71.168 0 129.024 52.736 129.024 117.76z"
								p-id="43483" fill="#515151"></path>
						</svg>
					</el-icon>
				</el-button>
				<el-button class="h-btn" link>
					<el-icon>
						<svg t="1691561250694" class="icon" viewBox="0 0 1024 1024" version="1.1"
							xmlns="http://www.w3.org/2000/svg" p-id="5673" width="32" height="32">
							<path
								d="M512.853333 988.330667c29.525333 0.170667 58.026667-11.434667 79.018667-32.256 20.992-20.821333 32.938667-49.152 32.938667-78.677334H400.896c0.341333 61.610667 50.346667 111.274667 111.957333 110.933334zM193.194667 500.736v4.949333c0 43.178667-13.312 84.309333-36.010667 121.856-8.021333 13.312-16.554667 25.088-24.917333 35.157334-4.949333 5.973333-8.533333 9.728-10.24 11.434666l-3.242667 3.584c-59.904 78.336-20.992 154.965333 78.336 154.965334H829.44c99.498667 0 134.997333-74.752 74.069333-152.576l-1.706666-2.218667-2.048-1.877333c-4.096-3.754667-7.850667-7.850667-11.434667-11.946667-10.069333-11.264-19.285333-23.381333-27.477333-36.010667-24.576-37.888-39.253333-78.848-39.253334-121.002666 0-2.389333 0-4.608 0.170667-6.997334v-76.458666c0-131.584-84.309333-257.706667-188.757333-282.282667-8.362667-60.757333-61.44-107.52-125.44-107.52-69.802667 0-111.104 47.445333-124.928 107.008-113.322667 48.128-189.098667 158.378667-189.098667 282.794667v63.658666c-0.341333 3.584-0.341333 6.826667-0.341333 13.482667z m65.536-72.192c0-105.130667 67.072-197.461333 165.546666-232.106667l21.845334-7.68V159.914667c0-32.938667 27.306667-60.074667 61.098666-60.074667 33.792 0 60.928 26.965333 60.928 60.074667v28.842666l21.845334 7.68c98.474667 34.474667 165.546667 126.976 165.546666 232.106667l0.170667 76.8-0.170667 7.509333c0 56.490667 18.773333 109.568 49.664 157.696 18.432 28.501333 36.864 49.493333 49.834667 61.44l-3.754667-4.096c27.989333 36.181333 22.186667 48.64-22.357333 48.64H197.12c-45.226667 0-53.248-15.872-26.112-51.882666l-3.242667 3.754666c11.946667-11.776 29.013333-32.256 45.738667-60.586666 28.16-47.445333 45.056-100.010667 45.056-156.672V493.909333l0.170667-65.365333z m0 0"
								p-id="5674" fill="#515151"></path>
						</svg>
					</el-icon>
				</el-button>
				<el-button class="h-btn" link>
					<el-icon>
						<svg t="1691561354328" class="icon" viewBox="0 0 1024 1024" version="1.1"
							xmlns="http://www.w3.org/2000/svg" p-id="9276" width="32" height="32">
							<path
								d="M412.953358 962.267475H163.531079a62.372593 62.372593 0 0 1-62.331738-62.890094V123.410576A62.999042 62.999042 0 0 1 163.939633 60.466007h682.489626a62.549633 62.549633 0 0 1 62.644963 62.522396v294.472178a30.219385 30.219385 0 1 0 60.43877 0V122.988403a122.961166 122.961166 0 0 0-36.116183-87.008405A122.974785 122.974785 0 0 0 846.320312 0.040855H163.939633A123.396957 123.396957 0 0 0 40.801427 123.410576v775.966805a122.824981 122.824981 0 0 0 122.729652 123.315246H412.994213a30.219385 30.219385 0 0 0 0-60.43877z m0 0"
								fill="#515151" p-id="9277"></path>
							<path
								d="M256.436281 293.777636h495.98468a30.219385 30.219385 0 0 0 0-60.43877H256.395426a30.219385 30.219385 0 0 0 0 60.43877z m0 185.94659h495.98468a30.219385 30.219385 0 0 0 0-60.43877H256.395426a30.219385 30.219385 0 0 0 0 60.43877z m0 185.932972h170.598575a30.219385 30.219385 0 1 0 0-60.425152H256.436281a30.219385 30.219385 0 1 0 0 60.425152z m494.050857 300.32812a176.645175 176.645175 0 1 0-176.645175-176.631557 176.631557 176.631557 0 0 0 176.645175 176.631557z m0 55.835727a232.426428 232.426428 0 1 1 232.371954-232.480902 232.426428 232.426428 0 0 1-232.371954 232.426428z m0 0"
								fill="#515151" p-id="9278"></path>
							<path
								d="M766.979105 698.246196a27.917864 27.917864 0 0 0-55.835727 0v109.083946a27.904245 27.904245 0 0 0 27.890626 27.890626h90.44026a27.917864 27.917864 0 1 0 0-55.835727h-62.495159z m0 0"
								fill="#515151" p-id="9279"></path>
						</svg>
					</el-icon>
				</el-button>
			</view>
		</view>
		<!-- 搜索框 -->
		<view class="topBottom">
			<div class="topInput">
				<el-input v-model="input" size="large" :placeholder="searchText">
					<template #append class="p-0">
						<el-button class="searchBtn" :icon="Search" />
					</template>
				</el-input>
			</div>
		</view>
	</view>
</template>

<script setup>
	import {
		Search,
		View as IconView
	} from '@element-plus/icons-vue'
	import {
		toRefs,
		defineProps
	} from 'vue'

	//子组件接收父组件传递过来的值
	const props = defineProps({
		searchText: String,
		text:String,
	})
	//使用父组件传递过来的值
	const {
		searchText,
		text
	} = toRefs(props)

	const input = ''
</script>

<style scoped>
	/* 顶部开始 */
	.header {
		padding: 10rpx 10rpx 0rpx 10rpx;
		/* background-color: #15a0ac; */
	}

	.header .title {
		width: 680rpx;
		display: flex;
		justify-content: space-between;
		flex-wrap: nowrap;
		padding: 0;
		margin: 30rpx auto;
		color: #15a0ac;
		position: relative;

	}

	.header .title .text {
		font-size: 24px;
	}

	.header .title .link {
		font-size: 20px;
		margin: 4rpx;
	}

	.header .title .link>.h-btn {
		font-size: 20px;
	}

	.header .title .link :deep(i) {
		/* margin: 4rpx; */
	}

	.header .title .background {
		background-color: #f6b02360;
		width: 96px;
		height: 6px;
		position: absolute;
		border-radius: 3px;
		overflow: hidden;
		/* top: 10px; */
		/* left: 4%; */
		bottom: 4px;
	}

	/* 下搜索框 */
	.header .topBottom {
		width: 680rpx;
		margin: 20rpx auto;
	}

	.header .topInput {
		border-radius: 40px !important;
		overflow: hidden;
	}

	.header .topInput :deep(.el-input__wrapper) {
		/* 如果没有下面这一行样式的话 无法对border进行自定义修改 */
		box-shadow: 0 0 0 0px var(--el-input-border-color, var(--el-border-color)) inset;
		border: none;
	}

	.header .searchBtn {
		height: 100%;
		border-radius: 0 40px 40px 0;
		border: none;
		background-color: #ffffff;
		font-size: 20px;
		padding: 9px 12px 7px 12px;
	}

	.header .searchBtn:hover,
	.searchBtn:checked {
		/* color: #f3efee; */
		background-color: #ffffff;
		color: #15a0ac;
	}

	/* 顶部结束 */
</style>